app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" LIMIT 11 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.page(params[:page]).per(11)