app/controllers/movies_controller.rb

  def index
     @movietimes = [["All",""],["Under 90 minutes", "0:90"], ["Between 90 and 120 minutes","90:120"], ["Over 120 minutes", "120:9999999999"]]
     @movies = Movie.all
---
SELECT "movies".* FROM "movies" WHERE (runtime_in_minutes >= '0' AND runtime_in_minutes <= '90')

  def create
    @movie = Movie.new(movie_params)

      if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["director", "Nolan"], ["updated_at", Thu, 22 Oct 2015 15:46:33 UTC +00:00]]